InformationRegisters/БИТ_ПочтаРФ_ПараметрыПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>БИТ_ПочтаРФ_ПараметрыПисем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидРПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияРПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКонверта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесРПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОЦ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипПисьма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыИсходящихПисем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/БИТ_ПочтаРФ_ПараметрыПисем/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Функция ВидКатегорииКорректен(Вид, Категория, Конверт)

	//Письмо 1-класса заказное
	Если Вид = "LETTER_CLASS_1" И Категория = "ORDERED" И (Конверт = "A6" ИЛИ Конверт = "A7") Тогда
		Возврат Ложь;
	КонецЕсли;
	//Бандероль заказная
	Если Вид = "BANDEROL" И Категория = "ORDERED" И (Конверт = "A6" ИЛИ Конверт = "DL") Тогда
		Возврат Ложь;
	КонецЕсли;
	//Бандероль 1-класса заказная
	Если Вид = "BANDEROL_CLASS_1" И Категория = "ORDERED" И (Конверт = "A6" ИЛИ Конверт = "DL" ИЛИ Конверт = "A7") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции // ()

&НаКлиенте
Процедура КонтрольВесаРПО() 
	
	Сообщение = Новый СообщениеПользователю;
	ТекстСообщения = "";

	Если Запись.ВесРПО >= 100 И (Запись.ВидРПО = "LETTER" ИЛИ Запись.ВидРПО = "LETTER_CLASS_1") Тогда
		ТекстСообщения = "Отправления весом более 100 граммов являются бандеролями!";
		Запись.ВидРПО = "BANDEROL";
	КонецЕсли;  
	
	Если Запись.ВесРПО < 100 И (Запись.ВидРПО = "BANDEROL" ИЛИ Запись.ВидРПО = "BANDEROL_CLASS_1") Тогда
		ТекстСообщения = "Отправления весом менее 100 граммов являются письмами!";
		Запись.ВидРПО = "LETTER";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();    
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ПроверкаВидКатегоряКонверт();
	
	Вид = Запись.ВидРПО;
	Категория = Запись.КатегорияРПО;
	Конверт = Запись.ТипКонверта;
	ТекстСообщения = "Несоответствующий тип конверта для данных категории и вида РПО!";
	
	Если НЕ ВидКатегорииКорректен(Вид, Категория, Конверт) Тогда
	
		Запись.ТипКонверта = "";
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
	
	КонецЕсли;

КонецПроцедуры	


&НаКлиенте
Процедура ВидРПОПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.ВесРПО) Тогда
		КонтрольВесаРПО();
	КонецЕсли;
	
	ПроверкаВидКатегоряКонверт();
КонецПроцедуры

&НаКлиенте
Процедура КатегорияРПОПриИзменении(Элемент)
	Если Запись.КатегорияРПО = "SIMPLE" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Внимание! Для простых отправлений нельзя получить ШПИ!";
		Сообщение.Сообщить();
	КонецЕсли;
	ПроверкаВидКатегоряКонверт();
КонецПроцедуры

&НаКлиенте
Процедура ТипКонвертаПриИзменении(Элемент)
	ПроверкаВидКатегоряКонверт();
КонецПроцедуры

&НаКлиенте
Процедура ВесРПОПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Запись.ВидРПО) Тогда
		КонтрольВесаРПО();
	КонецЕсли;
КонецПроцедуры
